## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.static_web_app["events"] will be created
  + resource "azurerm_resource_group" "static_web_app" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-zenisu-events"
    }

  # module.staticsite["events"].azurerm_static_web_app.this will be created
  + resource "azurerm_static_web_app" "this" {
      + api_key                            = (sensitive value)
      + configuration_file_changes_enabled = true
      + default_host_name                  = (known after apply)
      + id                                 = (known after apply)
      + location                           = "westeurope"
      + name                               = "stapp-zenisu-events"
      + preview_environments_enabled       = true
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-zenisu-events"
      + sku_size                           = "Free"
      + sku_tier                           = "Free"
    }

  # module.staticsite["events"].azurerm_static_web_app_custom_domain.this["default"] will be created
  + resource "azurerm_static_web_app_custom_domain" "this" {
      + domain_name       = "events.zeni-su.com"
      + id                = (known after apply)
      + static_web_app_id = (known after apply)
      + validation_token  = (sensitive value)
      + validation_type   = "cname-delegation"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>